{
    "volunteering": [
        {
            "start": "Mar 2022",
            "end": "Present",
            "organisation": "Google Developer Students Clubs, VIT Vellore",
            "role": "Full Stack Developer",
            "description": "Worked on projects and participated in hackathons as a part of the Tech domain. Held informative sessions for students on topics such as socket programming. Helped organise events such as WomenTechies '22, '23 and DevJams '22, in which I was a panel member for the judging process.",
            "techStack": [
                "Golang",
                "React",
                "Svelte",
                "NodeJS",
                "MongoDB",
                "PostgreSQL"
            ],
            "link": "https://dscvit.com/"
        }
    ],
    "experience": [
        {
            "start": "June 2024",
            "end": "July 2024",
            "organisation": "Well Fargo",
            "role": "Intern Analyst",
            "description": "Engineered a parser to define and consume complex trading strategies while keeping in mind flexibility (via 10+ comparators and operators) and end-user modularity. Added support for 15 technical indicators, with in-depth documentation on how to add custom indicators. Built a CLI and a Web App to interact with the above backend for easy usage of the app, and visualised 8 metrics using an interactive graphic dashboard.",
            "techStack": [
                "Python",
                "React",
                "Backtesting"
            ],
            "link": "https://www.wellsfargo.com/"
        },
        {
            "start": "Nov 2023",
            "end": "May 2024",
            "organisation": "BalkanID",
            "role": "Engineering Intern",
            "description": "Assisted in development of end-to-end features on the BalkanID core application, on the app frontend as well as in the data pipeline and API (such as a consolidated action centre). Wrote a CLI tool to interact with 10 download APIs with support for associated parameters. Integrated tooling for product walkthroughs and AI access to help docs, and helped author a detailed internal document for development related to it.",
            "techStack": [
                "Golang",
                "React",
                "AWS"
            ],
            "link": "https://www.balkan.id/"
        },
        {
            "start": "Aug 2023",
            "end": "Sept 2023",
            "organisation": "NITI Aayog",
            "role": "Research Intern",
            "description": "Interned at NITI Aayog, the apex think tank of the Government of India, as part of the Science and Technology (S&T) Vertical. Built web pages and database schemas for some government projects. Constructed a well-received research report on FOSS (Free and Open Source Software) for Government in India, and associated opportunities, challenges and case studies.",
            "techStack": [
                "FOSS",
                "Tech Policy"
            ],
            "link": "https://niti.gov.in/"
        }
    ]
}
